recipes/glogg.org.html
<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<!-- Created by htmlize-1.47 in css mode. -->
<html>
  <head>
    <title>glogg.org</title>
  </head>
  <body>
    <pre>
<span class="org-level-1">* Source</span>
  <span class="org-link"><a href="https://web.archive.org/web/20131226011244/http://www.folklifestyle.com/2013/12/glogg-scandinavian-mulled-wine.html">folklifestyle</a></span>

  Makes about 1/2 gallon

<span class="org-level-1">* Ingredients</span>
  * 1 bottle (750 mL) red wine
  * 1 bottle (750 mL) port
  * 1-2 cups brandy
  * 2 cinnamon sticks
  * 6-8 cardamom pods
  * 10 whole cloves
  * Peel of 2 medium oranges
  * 1/2 cup of raisins
  * 1/2 cup blanched almonds
  * 1 inch piece of fresh ginger, quartered
  * 1/2 cup turbinado (raw) sugar

<span class="org-level-1">* Steps</span>
  1) Pour wine and port in a pot. Add cinnamon, the seeds from the cardamom pods,
     cloves, orange peel (reserving some for garnish), raisins, almonds and ginger.
     Warm gently over low heat, being sure not to boil.
  2) Mix the sugar and the brandy in a separate pan.
     Warm over low heat, melting the sugar and allowing it to caramelize 
     and become slightly syrupy.
  3) Once the sugar has melted and caramelized, add the sugar/brandy mixture
     to pot with the wine and spices.
  4) Cover the pot and let the mixture mull over very low heat for 1 to 2 hours.
  5) Once the glogg has mulled, strain out the spice and fruit ingredients.
  6) Pour the glogg into mugs, garnish with an orange peel and enjoy!
  7) Glogg can also be re-bottled and aged for a couple months.
     To do this, simply pour mixture into wine bottles and seal very tightly.


</pre>
  </body>
</html>
